; domain
(define (domain depots)
(:requirements :strips :typing)
(:types place locatable - object
  depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depot_2_2_2_4_4_2) (:domain depots)
(:objects
  depot0 depot1 - depot
  distributor0 distributor1 - distributor
  truck0 truck1 - truck
  pallet0 pallet1 pallet2 pallet3 - pallet
  crate0 crate1 - crate
  hoist0 hoist1 hoist2 hoist3 - hoist)
(:init
  (at pallet0 depot0)
  (clear crate0)
  (at pallet1 depot1)
  (clear crate1)
  (at pallet2 distributor0)
  (clear pallet2)
  (at pallet3 distributor1)
  (clear pallet3)
  (at truck0 depot1)
  (at truck1 depot0)
  (at hoist0 depot0)
  (available hoist0)
  (at hoist1 depot1)
  (available hoist1)
  (at hoist2 distributor0)
  (available hoist2)
  (at hoist3 distributor1)
  (available hoist3)
  (at crate0 depot0)
  (on crate0 pallet0)
  (at crate1 depot1)
  (on crate1 pallet1)
)

(:goal (and
    (on crate0 pallet3)
  )
))

; plan
1. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 0 of 1
2. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 0 of 1
3. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 0 of 1
4. (unload hoist3 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 0 of 1
5. (drop hoist3 crate0 pallet3 distributor1)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor1) (clear crate0) (on crate0 pallet3)
   goals met: 1 of 1
